---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelPipes
source: html/fcfa13ce-0cbc-5dfc-752c-0464e76cd9f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelPipes Property

Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughRoomForParallelPipes { get; }
```